ed
vim
emacs
nano
gawk
grep
sed
dc
bc
make
flex
bison
valgrind
gdb
nasm
gcc
g++
clang
python
python3
perl
ruby
tclsh
ghc
swi-prolog
gprolog
gcl
ecl
sbcl
clisp
zenlisp
mit-scheme
racket

