algol68g
arduino
basic256
bc
binutils
bison
brandy
brasero
bwbasic
cccc
chicken-bin
clang
clisp
cmake
coreutils
csh
ctags
dc
default-jdk
devscripts
ecl
ed
elinks
elk
emacs
filezilla
firefox
fish
flex
fpc
g++
gawk
gcc
gcc-multilib
gcl
gdb
gdc
gdebi
gforth
ghc
git
g++-multilib
gnat
gprolog
graphviz
grep
groff
guile-1.8
guile-2.0
hexedit
htop
info
ipython
javacc
joe
kwrite
libc6-dev-i386
libreoffice
lolcat
lsscsi
make
mate
mate-desktop-environment
mate-desktop-environment-core
mate-desktop-environment-extras
mate-tweak
mit-scheme
mosh
nano
nasm
nethack-console
nmap
oaklisp
octave
partimage
pcregrep
pep8
perl
plt-scheme
postgresql
python
python3
python3-pip
python-nose
python-pip
qemu
racket
radare2
rep
rlwrap
ruby
sbcl
scala
scheme2c
scheme48
scheme9
screen
scsh-common-0.6
sed
sl
smlnj
sox
ssss
sublime
swi-prolog
tasksel
tclsh
tcsh
texlive-binaries
texlive-latex-base
tinyscheme
tk
tlp
ubuntu-mate-desktop
vagrant
valgrind
vim
virtualbox
virtualbox-ext-pack
vlc
vlc-nox
wine
yacc
zenlisp
zenmap
zsh